In [1]:
import pandas as pd
n = pd.read_csv('neighbourhoods.csv')

In [2]:
n.head()

   neighbourhood_group neighbourhood
0                  NaN       Allston
1                  NaN      Back Bay
2                  NaN   Bay Village
3                  NaN   Beacon Hill
4                  NaN      Brighton

In [5]:
n['neighbourhood_group'].isnull().value_counts()

True    26
Name: neighbourhood_group, dtype: int64

In [6]:
rev = pd.read_csv('reviews.csv')

In [7]:
rev.head()

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,3781,37776825,2015-07-10,36059247,Greg,The apartment was as advertised and Frank was ...
1,3781,41842494,2015-08-09,10459388,Tai,It was a pleasure to stay at Frank's place. Th...
2,3781,45282151,2015-09-01,12264652,Damien,The apartment description is entirely faithful...
3,3781,49022647,2015-09-30,41426327,Mike,Thoroughly enjoyed my time at Frank's home. Ha...
4,3781,52503327,2015-10-30,15151513,Ivan,Great value for the money! This location has e...

In [9]:
rev.isnull().sum().sort_values()

listing_id        0
id                0
date              0
reviewer_id       0
reviewer_name     1
comments         44
dtype: int64